// 1. Використовуючи цикл "while" виведіть в консоль цифри від 0 до 10;
// * Зробіть те саме за допомогою циклу "do while" i "for"
let i = 0
while(i < 11){
  console.log('i=',i)
  i++
}

i = 0
do{
  console.log('i=',i)
  i++
}while(i < 11)

for (i = 0; i < 11; i++){
  console.log('i=',i)
}


// 2. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   console.log(i);
//   ++i;
// }
// Відповідь: Ніяке, цикл не почнеться так як i = 0, а (i > 10) дасть false

// 3. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// do {
//   console.log(i);
//   ++i;
// } while (i < 10)
// Відповідь: Останній виклики console.log виведе 9.  


// 4. Замініть цей приклад використовуючи "while"
//
// for (let i = 0; i < 10; i++) {
//   console.log('i', i);
// }

let i = 0
while(i < 10){
  console.log('i',i)
  i++
}

// 5. Яке перше значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   ++i;
//   console.log(i);
// }
// Відповідь: Ніяке, цикл не почнеться так як i = 0, а (i > 10) дасть false


// 6. Яке перше значення буде виведено в консоль?
// let i = 1;
//
// do {
//   i++;
//   console.log(i);
// } while (i < 10)
// Відповідь: перший виклик console.log виведе 2