// 1) Використовуючи оператор "Рівності (==)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
let var1 = 0, var2 = '1', var3 = 1
console.log(var1 == var2) //false
console.log(var2 == var3) //true

// 2) Використовуючи оператор "Нерівності (!=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var2 != var3) //false
console.log(var1 != var2) //true

// 3) Використовуючи оператор "Строгої рівності (===)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var1 === var2) // false
var2-- // Now var1 = 0; var2 = 0; var3 = 1
console.log(var1 === var2) // true

// 4) Використовуючи оператор "Строгої нерівності (!==)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var1 !== var2) // false
console.log(var1 !== var3) // true

// 5) Використовуючи оператор "Більше ніж (>)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var2 > var3) // false
console.log(var3 > var2) // true

// 6) Використовуючи оператор "Більше чи дорівнює (>=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var2 >= var3) // false
console.log(var3 >= var2) // true


// 7) Використовуючи оператор "Менше ніж (<)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var3 < var2) // false
console.log(var2 < var3) // true

// 8) Використовуючи оператор "Менше чи дорівнює (<=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(var3 <= var2) // false
console.log(var2 <= var3) // true

// 9) Використовуючи оператор "Логічне І (&&)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(Boolean(var1) && var2) //false
var2++ // Now var1 = 0; var2 = 1; var3 = 1
console.log(Boolean(var3) && Boolean(var2)) //true

// 10) Використовуючи оператор "Логічне АБО (||)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
var2-- // Now var1 = 0; var2 = 0; var3 = 1
console.log(Boolean(var1) || Boolean(var2)) //false
console.log(Boolean(var3) || Boolean(var2)) //true

// 11) Використовуючи оператор "Логічне НЕ (!)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
console.log(Boolean(!var3)) //false
console.log(Boolean(!var2)) //true

// 12) Використовуючи оператор "Рядкове додавання (+)" додайте два значення типу "string".
// * Виведіть результат в консоль за допомогою "console.log"
let string1 = 'Hello '
let string2 = 'world!'
console.log(string1 + string2)

// 13) За допомогою тернарного оператору присвойте значення у змінну "type" використовуючи змінну "color". Якщо колір дорівнює "червоний", тоді значення змінної має бути "пожежна" інакше "медична".
// * Виведіть "type" в консоль за допомогою "console.log". Зробіть два варіанти в одному резyльтат в консолі має бути "пожежна" в іншому "медична"
let color = 'червоний'
let type = (color == 'червоний')?'пожежна':'медична'
console.log(type)
color = 0
type = (color == 'червоний')?'пожежна':'медична'
console.log(type)

// 14) Створіть об'єкт з довільними ключами і видаліть довільний ключ за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"
let truba = {
  a: 'sideli',
  b: 'sideli'
}
delete truba.a
console.log(truba)

// 15) Створіть масив з довільними значеннями і видаліть довільне значення за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"
let arr = [1,2,3,4,5,6,7,8,9,0]
delete arr[9]
console.log(arr)

// 16) Створіть об'єкт з довільними ключами і за допомогою оператору "in" визначіть наявність ключів у об'єкті. Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"
let someObj = {
  prop1: 'value',
  prop2: 'value'
}
console.log('prop1' in someObj) //true
console.log('prop3' in someObj) //false

// 16) Створіть масив з довільними значеннями і за допомогою оператору "in" визначіть наявність значення у масиві. Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"
let someArr = [1,2,3,4,5,6,7,8,9,0]
console.log('1' in someArr) //true
console.log('11' in someArr) //false